 NPK2 : PROC OPTIONS(MAIN) ;
 DCL NPK1 ENTRY     RETURNS(CHAR(4));

     FETCH NPK1 ;

     PUT SKIP LIST('THE SYSTEM IM RUNNING ON IS = ',NPK1());
 END NPK2;
